derivative.html

<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-17 Sat 17:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Derivatives</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Laurent Garnier" />
</head>
<body>
<div id="content">
<h1 class="title">Derivatives</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb718685">1. Source</a></li>
<li><a href="#org0d55b32">2. Basic Formulas</a>
<ul>
<li><a href="#orgb7bb2de">2.1. General definition</a>
<ul>
<li><a href="#orge7d3e3f">2.1.1. Example</a></li>
<li><a href="#org0de68b3">2.1.2. Definition 1</a></li>
<li><a href="#org42cace2">2.1.3. Definition 2</a></li>
<li><a href="#orgfcc5b0e">2.1.4. Examples</a></li>
<li><a href="#org911e064">2.1.5. Exercices</a></li>
<li><a href="#org77bc97c">2.1.6. Definition 3</a></li>
<li><a href="#orgad58148">2.1.7. Examples</a></li>
<li><a href="#org0ce79e1">2.1.8. Exercices</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb718685" class="outline-2">
<h2 id="orgb718685"><span class="section-number-2">1</span> Source</h2>
<div class="outline-text-2" id="text-1">
<p>
This content is a part of <a href="https://laurentgarnier.podia.com/pratiques-mathematiques-en-1ere">Pratiques Mathematiques</a> (in French)
created by Laurent Garnier.
</p>

<p>
This document (in English) has borrowed some inspiration from the
Oxford IB (International Baccalaureate) Diploma programme that you
can get on Amazon: <a href="https://amzn.to/3SamRaK">https://amzn.to/3SamRaK</a>
</p>

<iframe sandbox="allow-popups allow-scripts allow-modals allow-forms allow-same-origin" style="width:120px;height:240px;" marginwidth="0" marginheight="0" scrolling="no" frameborder="0" src="//ws-eu.amazon-adsystem.com/widgets/q?ServiceVersion=20070822&OneJS=1&Operation=GetAdHtml&MarketPlace=FR&source=ss&ref=as_ss_li_til&ad_type=product_link&tracking_id=wwwbecomefree-21&language=fr_FR&marketplace=amazon&region=FR&placement=0198390122&asins=0198390122&linkId=f4c41ba8d562cad8f3241d3ec08fd520&show_border=true&link_opens_in_new_window=true"></iframe>


<p>
You can get the full course here:
<a href="https://laurentgarnier.podia.com/pratiques-mathematiques-en-1ere">https://laurentgarnier.podia.com/pratiques-mathematiques-en-1ere</a>
</p>
</div>
</div>


<div id="outline-container-org0d55b32" class="outline-2">
<h2 id="org0d55b32"><span class="section-number-2">2</span> Basic Formulas</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb7bb2de" class="outline-3">
<h3 id="orgb7bb2de"><span class="section-number-3">2.1</span> General definition</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The derivative in mathematics is the rate at which one quantity
alters in relation to another. <b>Differentiation</b> is the name given to
the process of determining the derivative. The calculus is a branch
of mathematics that is based on these concepts.
</p>
</div>

<div id="outline-container-orge7d3e3f" class="outline-4">
<h4 id="orge7d3e3f"><span class="section-number-4">2.1.1</span> Example</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
At any time \(t\) seconds, \(t > 1\), and \(d = -t^2 + t + 6\), a ball
traveling toward the edge of a ping-pong table is \(d\) cm away from
the edge. Calculate the ball's average speed between the first and
third seconds.
</p>

<p>
Average speed = total distance \(\div\) total time.
</p>

<p>
\[\dfrac{\left[-(3)^2 + 3 + 6\right]-\left[-(1)^2+1+6\right]}{3-1}
    = -3\]
</p>

<p>
The speed of the ball is 3 cm\(s^{-1}\).
</p>
</div>
</div>

<div id="outline-container-org0de68b3" class="outline-4">
<h4 id="org0de68b3"><span class="section-number-4">2.1.2</span> Definition 1</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Typically, a function's average rate between two input values, \(x_1\)
and \(x_2\), is provided by
</p>

<p>
\[\dfrac{\Delta y}{\Delta x} = \dfrac{f(x_2)-f(x_1)}{x_2-x_1}\]
</p>

<p>
(read as 'the change in \(y\) divided by the change in \(x\)' where
\(\Delta\) is the Greek letter delta.)
</p>
</div>
</div>


<div id="outline-container-org42cace2" class="outline-4">
<h4 id="org42cace2"><span class="section-number-4">2.1.3</span> Definition 2</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
The gradient of a curve \[y = f(x)\] at the point \[(x_0, f(x_0))\] is
\[ \lim_{h\to 0}\dfrac{f(x_0 + h) - f(x_0)}{h} \]  provided this
limit exists.
</p>

<p>
If this limit exists the gradient of of a curve \[y = f(x)\] at the
point \[(x_0, f(x_0))\] is written \[f'(x_0)\]
</p>
</div>
</div>

<div id="outline-container-orgfcc5b0e" class="outline-4">
<h4 id="orgfcc5b0e"><span class="section-number-4">2.1.4</span> Examples</h4>
<div class="outline-text-4" id="text-2-1-4">
</div>
<ol class="org-ol">
<li><a id="orgbebea67"></a>Example 1<br />
<div class="outline-text-5" id="text-2-1-4-1">
<p>
Find the gradient of the curve \(y = x^2\) at the point \(x_0 = -2\).
</p>
</div>
</li>

<li><a id="org4b734eb"></a>Solution 1<br />
<div class="outline-text-5" id="text-2-1-4-2">
\begin{align*}
\dfrac{\Delta y}{\Delta x} &= \dfrac{(-2+h)^2-(-2)^2}{(-2+h)-(-2)}\\
\dfrac{\Delta y}{\Delta x} &= \dfrac{4-4h+h^2-4}{h}\\
\dfrac{\Delta y}{\Delta x} &= \dfrac{-4h+h^2}{h}\\
\dfrac{\Delta y}{\Delta x} &= \dfrac{h(-4+h)}{h}\\
\dfrac{\Delta y}{\Delta x} &= -4+h
\end{align*}


<p>
Hence \[\lim_{h\to 0} (-4+h) = -4\]
</p>
</div>
</li>



<li><a id="org6dbe1eb"></a>Example 2<br />
<div class="outline-text-5" id="text-2-1-4-3">
<p>
Find the points on the curve \(y = \dfrac{1}{x}\) such that the
gradient at these points is \(-\dfrac{1}{9}\).
</p>
</div>
</li>

<li><a id="org5431e75"></a>Solution 2<br />
<div class="outline-text-5" id="text-2-1-4-4">
<p>
Consider the point \(\left(x_0, \dfrac{1}{x_0}\right)\) and a
neighboring point \(\left(x_0 + h, \dfrac{1}{x_0 + h}\right)\).
</p>



\begin{align*}
\dfrac{\Delta y}{\Delta x} &= \dfrac{\dfrac{1}{x_0 + h}-\dfrac{1}{x_0}}{(x_0+h)-x_0}\\
\dfrac{\Delta y}{\Delta x} &= \dfrac{\dfrac{x_0-(x_0+h)}{x_0(x_0+h)}}{h}\\
\dfrac{\Delta y}{\Delta x} &= \dfrac{\dfrac{-h}{x_0^2+x_0h}}{h}\\
\dfrac{\Delta y}{\Delta x} &= \dfrac{-1}{x_0^2+x_0h}
\end{align*}


<p>
Therefore:
</p>

<p>
\[\lim_{h\to 0} \dfrac{-1}{x_0^2+x_0h} = -\dfrac{1}{x_0^2}\]
</p>

<p>
So \(-\dfrac{1}{x_0^2} = -\dfrac{1}{9}\) hence \(x_0 = \pm 3\).
</p>

<p>
The points are \(\left(3, \dfrac{1}{3}\right)\) and \(\left(-3,
     -\dfrac{1}{3}\right)\).
</p>
</div>
</li>
</ol>
</div>





<div id="outline-container-org911e064" class="outline-4">
<h4 id="org911e064"><span class="section-number-4">2.1.5</span> Exercices</h4>
<div class="outline-text-4" id="text-2-1-5">
<ol class="org-ol">
<li>Find the gradient of the curve at the given value of \(x\).
<ol class="org-ol">
<li>\(y = 3x^2 - 2x - 1\) at \(x = 5\)</li>
<li>\(y = \dfrac{3}{x}\) at \(x = -2\)</li>
<li>\(y = x^3\) at \(x = 7\)</li>
</ol></li>
<li>Find the point on the curve \(y = \dfrac{1}{x^2}\), such that the
gradient at the point is 3.</li>
<li>Find the gradient function of the curve \(y = 2x^2 +
       \dfrac{1}{x}\) and then the point on the curve where the
gradient is 3.</li>
</ol>
</div>
</div>

<div id="outline-container-org77bc97c" class="outline-4">
<h4 id="org77bc97c"><span class="section-number-4">2.1.6</span> Definition 3</h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
The <b>derivative</b>, or <b>gradient function</b>, of a function \(f\) with
respect to \(x\) is the function \[f'(x) = \lim_{h\to
    0}\dfrac{f(x+h)-f(x)}{h}\], provided this limit exists.
</p>

<p>
If \(f'\) exists, then \(f\) has a derivative at \(x\), or is
<b>differentiable</b> at \(x\). (\(f'(x)\) is read '\(f\) dash' or '\(f\)
prime', of \(x\).) Another notation for the derivative is
\(\dfrac{dy}{dx}\), the derivative of the function \(y = f(x)\) with
respect \(x\).
</p>

<p>
A function is differentiable if the derivative exists for all \(x\)
in the domain of \(f\).
</p>
</div>
</div>

<div id="outline-container-orgad58148" class="outline-4">
<h4 id="orgad58148"><span class="section-number-4">2.1.7</span> Examples</h4>
<div class="outline-text-4" id="text-2-1-7">
</div>
<ol class="org-ol">
<li><a id="org8d6e3f3"></a>Example 1<br />
<div class="outline-text-5" id="text-2-1-7-1">
<p>
Find \(f'(x)\) given that \(f(x) = 2x^2 + x\), and hence find the
gradient of the function at \(x = -3\).
</p>

\begin{align*}
f'(x) &= \lim_{h\to 0}\dfrac{2(x+h)^2+(x+h)-(2x^2+x)}{h}\\
f'(x) &= \lim_{h\to 0}(4x+1+2h)\\
f'(x) &= 4x+1\\
f'(-3) &= -11
\end{align*}
</div>
</li>

<li><a id="orgf901888"></a>Example 2<br />
<div class="outline-text-5" id="text-2-1-7-2">
<p>
A particle moves in a straight line so that its position from its
starting point at any time \(t\), in seconds, is given by \(s =
     4t^2\), where \(s\) is in metres. The particle passes through a
point \(P\) when \(t = a\) and then sometime later it passes through
point \(Q\) when \(t = a + h\). Find the average velocity as the
particle travels from point \(P\) to point \(Q\), and deduce its
velocity at the instant it passes through \(P\).
</p>

<p>
\(P(a, 4a^2)\) and \(Q(a+h, 4(a+h)^2)\)
</p>

\begin{align*}
\text{Average velocity } &= \dfrac{4(a+h)^2-4a^2}{(a+h)-a}\\
\text{Average velocity } &= \dfrac{4(a^2+2ah+h^2)-4a^2}{h}\\
\text{Average velocity } &= \dfrac{4h^2+8ah}{h}\\
\text{Average velocity } &= h\dfrac{4h+8a}{h}\\
\text{Average velocity } &= 4h+8
\end{align*}

<p>
Velocity at P = 8am\(s^{-1}\).
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org0ce79e1" class="outline-4">
<h4 id="org0ce79e1"><span class="section-number-4">2.1.8</span> Exercices</h4>
<div class="outline-text-4" id="text-2-1-8">
<ol class="org-ol">
<li>Find the gradient function of the given curve, and then the
value of the gradient to the curve at the given point.
<ol class="org-ol">
<li>\(y = 4x^2 - 5x + 1\) at \(x = \dfrac{3}{8}\).</li>
<li>\(y = \sqrt{x}\) at \(x = 4\).</li>
<li>\(y = \dfrac{2}{x}\) at \(x = 3\).</li>
<li>\(y = \sqrt{x - 2}\) at \(x = 11\).</li>
<li>\(y = \dfrac{1}{\sqrt{x}}\) at \(x = 25\).</li>
</ol></li>
<li>A particle moves in a straight line so that its position from
its starting point after \(t\) seconds is \(12-5t^2\). If the
particles passes through point \(A\) when \(t = a\), and point \(B\)
when \(t = a + h\), find
<ol class="org-ol">
<li>the average velocity of the object as it moves from \(A\) to
\(B\)</li>
<li>the velocity as it passes through point \(A\).</li>
</ol></li>
</ol>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Laurent Garnier</p>
<p class="date">Created: 2022-09</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>

